# What is Pandas?
<a id="pandas"> </a>

The `pandas` package is one of the most popular Python tools for data management and manipulation. `pandas` is built *on top* of `numpy`. Thus, much of the functionality and methods that are available in `numpy` are also available in `pandas`.

## Getting started
The`pandas` package is included with Anconda, but can be installed using either `conda` or `pip`.
```Python
# Use default channel
conda install pandas

# Specify the conda-forge channel
conda install -c conda-forge pandas

# Use pip
pip install pandas

```

### Set max rows/columns

To see more than the default number of rows and column, set the display options.

In [57]:
import pandas as pd

pd.set_option('display.max_columns', 85)
pd.set_option('display.max_rows', 85)

# Series and DataFrames
A pandas Series object is a one-dimensional labeled array that can hold any data type. It is one of two fundamental data structures provided by the pandas library. The other data structure is the DataFrame, which we'll examine next. Isolating a single column from a DataFrame results in a Series object.

A Series consists of two main components: the index and the data. The index provides labels for each element in the Series, allowing for easy and efficient data access and alignment. The data component contains the actual values.

You can create a Series using various data sources, such as lists, arrays, dictionaries, DataFrames, or even other Series objects. Here's an example of creating a Series from a list:

In [58]:
import pandas as pd

In [59]:
grades = [88, 67, 100, 92, None, 95, 82, 100, 100, 95]
grade_series = pd.Series(grades)
grade_series

0     88.0
1     67.0
2    100.0
3     92.0
4      NaN
5     95.0
6     82.0
7    100.0
8    100.0
9     95.0
dtype: float64

Note that a default index is added to the grades to create the series object.

Alternatively, you can specify an index. In this case, the stduent ID is provided as the index.

In [60]:
grades = [88, 67, 100, 92, None, 95, 82, 100, 100, 95]
students = ['dmac', 'edev', 'joeb', 'tdog', 'txroy', 'sthicks', 'jfrerk', 'spickard', 'choenes', 'jsisson']
student_grades_series = pd.Series(grades, students)
student_grades_series

dmac         88.0
edev         67.0
joeb        100.0
tdog         92.0
txroy         NaN
sthicks      95.0
jfrerk       82.0
spickard    100.0
choenes     100.0
jsisson      95.0
dtype: float64

Understanding what type of object you're working with is important in any programming language. Different objects (classes) have different methods and attributes. A pandas Series object has different methods and attributes than a pandas DataFrame. Below is a partial listing of the methods available with Series objects.

## Series functions

### head()/tail()
View the first few or last few items in a Series using head/tail.

In [61]:
grade_series.head(10)

0     88.0
1     67.0
2    100.0
3     92.0
4      NaN
5     95.0
6     82.0
7    100.0
8    100.0
9     95.0
dtype: float64

In [62]:
grade_series.tail()

5     95.0
6     82.0
7    100.0
8    100.0
9     95.0
dtype: float64

### Math functions
* describe() - Display descriptive statistics of your data using the ```describe()``` function.
* sum()
* min()
* max()
* mean()
* median()
* std()

In [63]:
grade_series.describe()

count      9.000000
mean      91.000000
std       10.851267
min       67.000000
25%       88.000000
50%       95.000000
75%      100.000000
max      100.000000
dtype: float64

In [64]:
grade_series.min()

67.0

In [65]:
grade_series.median()

95.0

### Data Manipulation Functions
* isnull() - checks for missing values (null/NaN)
* unique() - returns an list of unique values
* value_counts() - returns the fequencies of unique values
* apply(function) - applies a function to each element
* dropna() - returns a new series with missing values removed

### isnull()
Use ```isnull()``` to check for null values. A True/False series is returned, which corresponds to each item in the series. True indicates the value is null (NaN). NaN means "Not a Number."

In [66]:
grade_series.isnull()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9    False
dtype: bool

### unique() - Find unique values

In [67]:
print(grade_series.unique())

[ 88.  67. 100.  92.  nan  95.  82.]

### apply() function
Use the apply function to modify every item in a series using a standard or custom function. In this example, we use a custom function to create a series containing the letter grade.

In [68]:
def number_to_letter_grade(score):

    if score > 89:
        return "A"
    elif score > 79:
        return "B"
    elif score > 69:
        return "C"
    elif score > 59:
        return "D"
    else:
        return None

In [69]:
number_to_letter_grade(62)

'D'

apply() - Modifying values using a function

In [70]:
letter_series = grade_series.apply(number_to_letter_grade)

In [71]:
letter_series

0       B
1       D
2       A
3       A
4    None
5       A
6       B
7       A
8       A
9       A
dtype: object

In [72]:
grades_no_missing = grade_series.dropna()
grades_no_missing

0     88.0
1     67.0
2    100.0
3     92.0
5     95.0
6     82.0
7    100.0
8    100.0
9     95.0
dtype: float64

Notice that the None/null/NaN item has been removed.

# Indexes

# Locating and Filtering data

In [4]:
import pandas as pd
df_people = pd.read_csv('files/people_data.csv')
print(df_people.shape)
df_people.head()

(200, 12)

,First Name,Last Name,Gender,Age,Email,Phone,Education,Occupation,Experience (Years),Salary,Marital Status,Number of Children
0,amy,moore,Female,26,a.moore@randatmail.com,177-8697-63,Bachelor,Astronomer,11,118590,Married,4
1,rosie,henderson,Female,29,r.henderson@randatmail.com,747-7768-48,Primary,Manager,14,42540,Single,1
2,garry,cooper,Male,29,g.cooper@randatmail.com,131-0615-33,Upper secondary,Agronamist,11,149123,Single,3
3,sarah,miller,Female,27,s.miller@randatmail.com,811-2617-15,Primary,Pharmacist,6,97946,Single,2
4,rubie,sullivan,Female,23,r.sullivan@randatmail.com,543-4162-06,Bachelor,Engineer,8,78613,Married,4

## Loading data and specifying an index
If the data you are loading has a column that should be used as an index, you can specify that column as the index. Although there are better attributes to use for an index, we could index individuals using their email address number using the following statement. Note that the Email column appears far left and in bold indicating is is the index.

In [33]:
df_people = pd.read_csv('files/people_data.csv', index_col = 'Email')
df_people.head()

,First Name,Last Name,Gender,Age,Phone,Education,Occupation,Experience (Years),Salary,Marital Status,Number of Children
Email,,,,,,,,,,,
a.moore@randatmail.com,amy,moore,Female,26,177-8697-63,Bachelor,Astronomer,11,118590,Married,4
r.henderson@randatmail.com,rosie,henderson,Female,29,747-7768-48,Primary,Manager,14,42540,Single,1
g.cooper@randatmail.com,garry,cooper,Male,29,131-0615-33,Upper secondary,Agronamist,11,149123,Single,3
s.miller@randatmail.com,sarah,miller,Female,27,811-2617-15,Primary,Pharmacist,6,97946,Single,2
r.sullivan@randatmail.com,rubie,sullivan,Female,23,543-4162-06,Bachelor,Engineer,8,78613,Married,4

In [34]:
df_people.reset_index(inplace=True)

In [35]:
df_people

,Email,First Name,Last Name,Gender,Age,Phone,Education,Occupation,Experience (Years),Salary,Marital Status,Number of Children
0,a.moore@randatmail.com,amy,moore,Female,26,177-8697-63,Bachelor,Astronomer,11,118590,Married,4
1,r.henderson@randatmail.com,rosie,henderson,Female,29,747-7768-48,Primary,Manager,14,42540,Single,1
2,g.cooper@randatmail.com,garry,cooper,Male,29,131-0615-33,Upper secondary,Agronamist,11,149123,Single,3
3,s.miller@randatmail.com,sarah,miller,Female,27,811-2617-15,Primary,Pharmacist,6,97946,Single,2
4,r.sullivan@randatmail.com,rubie,sullivan,Female,23,543-4162-06,Bachelor,Engineer,8,78613,Married,4
...,...,...,...,...,...,...,...,...,...,...,...,...
195,l.ellis@randatmail.com,lana,ellis,Female,20,986-4830-56,Doctoral,Engineer,5,198642,Single,2
196,m.lloyd@randatmail.com,miller,lloyd,Male,19,685-5796-27,Master,Archeologist,9,162273,Single,4
197,s.kelley@randatmail.com,spike,kelley,Male,29,533-2352-91,Primary,Medic,14,137587,Single,0
198,v.hamilton@randatmail.com,vanessa,hamilton,Female,28,592-7262-90,Upper secondary,Mechanic,9,67962,Married,4
199,s.andrews@randatmail.com,savana,andrews,Female,25,870-9824-77,Doctoral,Cook,11,109137,Married,1

In [36]:
df_people.set_index('Phone', inplace=True)

In [37]:
df_people

,Email,First Name,Last Name,Gender,Age,Education,Occupation,Experience (Years),Salary,Marital Status,Number of Children
Phone,,,,,,,,,,,
177-8697-63,a.moore@randatmail.com,amy,moore,Female,26,Bachelor,Astronomer,11,118590,Married,4
747-7768-48,r.henderson@randatmail.com,rosie,henderson,Female,29,Primary,Manager,14,42540,Single,1
131-0615-33,g.cooper@randatmail.com,garry,cooper,Male,29,Upper secondary,Agronamist,11,149123,Single,3
811-2617-15,s.miller@randatmail.com,sarah,miller,Female,27,Primary,Pharmacist,6,97946,Single,2
543-4162-06,r.sullivan@randatmail.com,rubie,sullivan,Female,23,Bachelor,Engineer,8,78613,Married,4
...,...,...,...,...,...,...,...,...,...,...,...
986-4830-56,l.ellis@randatmail.com,lana,ellis,Female,20,Doctoral,Engineer,5,198642,Single,2
685-5796-27,m.lloyd@randatmail.com,miller,lloyd,Male,19,Master,Archeologist,9,162273,Single,4
533-2352-91,s.kelley@randatmail.com,spike,kelley,Male,29,Primary,Medic,14,137587,Single,0
592-7262-90,v.hamilton@randatmail.com,vanessa,hamilton,Female,28,Upper secondary,Mechanic,9,67962,Married,4
870-9824-77,s.andrews@randatmail.com,savana,andrews,Female,25,Doctoral,Cook,11,109137,Married,1

In [75]:
df_people.iloc[:5,[0,1,3]]

                           First Name  Last Name  Age
Email
a.moore@randatmail.com            amy      moore   26
r.henderson@randatmail.com      rosie  henderson   29
g.cooper@randatmail.com         garry     cooper   29
s.miller@randatmail.com         sarah     miller   27
r.sullivan@randatmail.com       rubie   sullivan   23

The iloc function in pandas is used for indexing and selecting data from a DataFrame based on integer positions. It allows you to specify row and column indices to access specific data points or subsets of the DataFrame.

The general syntax of iloc is:

```Python
df.iloc[row_index(s), column_index(s)]


```

In [76]:
# Return the first row. Since it is one-dimensional, it is returned as a Series.
df_people.iloc[1]

First Name                  rosie
Last Name               henderson
Gender                     Female
Age                            29
Phone                 747-7768-48
Education                 Primary
Occupation                Manager
Experience (Years)             14
Salary                      42540
Marital Status             Single
Number of Children              1
Name: r.henderson@randatmail.com, dtype: object

In [77]:
# Return the first 8 rows and first 2 columns (the 0 can be ommitted)
df_people.iloc[0:8,0:2]

                           First Name  Last Name
Email
a.moore@randatmail.com            amy      moore
r.henderson@randatmail.com      rosie  henderson
g.cooper@randatmail.com         garry     cooper
s.miller@randatmail.com         sarah     miller
r.sullivan@randatmail.com       rubie   sullivan
f.williams@randatmail.com       fiona   williams
t.carter@randatmail.com        thomas     carter
s.martin@randatmail.com        sawyer     martin

In [78]:
# Return rows 1, 3, and 5 and show only the first name, last name, and salary
df_people.iloc[[1,3,5],[0,1,9]]

                           First Name  Last Name Marital Status
Email
r.henderson@randatmail.com      rosie  henderson         Single
s.miller@randatmail.com         sarah     miller         Single
f.williams@randatmail.com       fiona   williams         Single

## Using loc()
The ```loc()``` function in pandas is used for indexing and selecting data from a DataFrame based on labels. It allows you to specify row and column labels to access specific data points or subsets of the DataFrame.

The general syntax of loc is:

```Python
df.loc[row_label(s), column_label(s)]
```

In [96]:
df_people.loc['r.sullivan@randatmail.com']

First Name          rubie
Last Name        sullivan
Phone         543-4162-06
Name: r.sullivan@randatmail.com, dtype: object

In [98]:
df_people.loc['r.sullivan@randatmail.com':'e.robinson@randatmail.com', ['First Name', 'Last Name', 'Phone']]

                          First Name Last Name        Phone
Email
r.sullivan@randatmail.com      rubie  sullivan  543-4162-06
f.williams@randatmail.com      fiona  williams  807-4311-40
t.carter@randatmail.com       thomas    carter  281-1436-40
s.martin@randatmail.com       sawyer    martin  905-3877-91
e.robinson@randatmail.com    eleanor  robinson  049-5493-56

In [79]:
married_filter = (df_people['Marital Status'] == "Married")

In [90]:
df_email_index = df_people.loc[married_filter]
df_email_index.head()

,First Name,Last Name,Gender,Age,Phone,Education,Occupation,Experience (Years),Salary,Marital Status,Number of Children
Email,,,,,,,,,,,
a.moore@randatmail.com,amy,moore,Female,26,177-8697-63,Bachelor,Astronomer,11,118590,Married,4
r.sullivan@randatmail.com,rubie,sullivan,Female,23,543-4162-06,Bachelor,Engineer,8,78613,Married,4
s.martin@randatmail.com,sawyer,martin,Male,20,905-3877-91,Upper secondary,Lawer,7,140405,Married,0
e.robinson@randatmail.com,eleanor,robinson,Female,20,049-5493-56,Primary,Scientist,6,194147,Married,3
a.kelley@randatmail.com,adrianna,kelley,Female,22,251-3368-86,Upper secondary,Actor,0,160569,Married,1

## Using logic and multiple attributes to locate data
If we wanted to find Managers and Engineers who are married, we would use the following filter. Note the use of '&' for 'and' and the vertial bar '|' for 'or'.

In [81]:
multi_filter = (df_people['Marital Status'] == "Married") & ((df_people['Occupation']=='Manager') | (df_people['Occupation']=='Engineer'))

In [82]:
df_people.loc[multi_filter]

,First Name,Last Name,Gender,Age,Phone,Education,Occupation,Experience (Years),Salary,Marital Status,Number of Children
Email,,,,,,,,,,,
r.sullivan@randatmail.com,rubie,sullivan,Female,23,543-4162-06,Bachelor,Engineer,8,78613,Married,4
a.cameron@randatmail.com,alisa,cameron,Female,30,178-7304-99,Lower secondary,Engineer,7,193299,Married,3
m.morrison@randatmail.com,mike,morrison,Male,30,999-4285-82,Doctoral,Manager,8,94263,Married,2
v.foster@randatmail.com,violet,foster,Female,18,923-6053-60,Master,Manager,2,180192,Married,4
r.edwards@randatmail.com,robert,edwards,Male,21,913-0408-26,Upper secondary,Engineer,8,173872,Married,2
a.richards@randatmail.com,arthur,richards,Male,28,292-0356-03,Upper secondary,Manager,4,99047,Married,1
e.russell@randatmail.com,eleanor,russell,Female,29,383-7318-08,Primary,Manager,11,161017,Married,2
j.west@randatmail.com,james,west,Male,19,498-5620-38,Primary,Engineer,1,43406,Married,5

# Modifying data

## unique() and nunique()

The ```unique()``` function returns an array or list containing all the unique values present in a Series or column of a DataFrame. It eliminates any duplicates and provides a sorted array of unique values.

The ```nunique()``` function returns the count of unique values in a Series or column of a DataFrame. It provides the total number of distinct values, excluding any duplicates.

In [46]:
df_people['Occupation'].unique()

array(['Astronomer', 'Manager', 'Agronomist', 'Pharmacist', 'Engineer',
       'Lecturer', 'Veteranarian', 'Lawyer', 'Scientist', 'Actor',
       'Baker', 'Veterinarian', 'Economist', 'Salesman',
       'Fashion Designer', 'Interpreter', 'Programmer', 'Driver',
       'Fine Artist', 'Botanist', 'Police Officer', 'Bottanist', 'Singer',
       'Composer', 'Medic', 'Electrician', 'Architect', 'Accountant',
       'Carpenter', 'Jeweller', 'Geologist', 'Graphic Designer',
       'Physicist', 'Dancer', 'Cook', 'Mathematician', 'Aeroplane Pilot',
       'Photographer', 'Social Worker', 'Teacher', 'Interior Designer',
       'Auditor', 'Chemist', 'Chef', 'Biochemist', 'Journalist',
       'Florist', 'Meteorologist', 'Historian', 'Hairdresser', 'Producer',
       'Mechanic', 'Firefighter', 'Archeologist'], dtype=object)

In [40]:
df_people.loc[df_people['Occupation']=='Agronamist', 'Occupation']='Agronomist'

In [45]:
df_people['Occupation'] = df_people['Occupation'].replace('Lawer','Lawyer')

In [42]:
df_people['Occupation'].nunique()

54

In [89]:
print(df_people['Education'].unique())
print(df_people['Education'].nunique())

['Bachelor' 'Primary' 'Upper secondary' 'Doctoral' 'Lower secondary'
 'Master']
6

# Add / Remove Rows and Columns

# Grouping and Aggregating

# Using get_group()

Invoking the groupby() function on a DataFrame returns a pandas groupby object.

In [54]:
occupation_grp = df_people.groupby('Occupation')

Specify the columns of interest and the aggregation function, for example, mean(), to diplay the results.

In [48]:
df_people.groupby('Occupation')[['Experience (Years)', 'Salary']].mean()

                   Experience (Years)         Salary
Occupation
Accountant                   6.500000  132065.750000
Actor                        6.000000  104139.666667
Aeroplane Pilot              7.000000  125381.000000
Agronomist                  10.000000  153753.000000
Archeologist                 6.000000  122474.500000
Architect                    9.000000  106176.400000
Astronomer                   4.000000  141173.400000
Auditor                      3.400000  101193.600000
Baker                        4.000000  100506.000000
Biochemist                   6.000000   60657.333333
Botanist                    10.333333   69720.666667
Bottanist                    1.000000   54275.500000
Carpenter                    5.000000  174027.333333
Chef                         4.000000   86181.666667
Chemist                     10.666667  125752.666667
Composer                     8.400000  117194.800000
Cook                         8.333333  113121.333333
Dancer                       3.333333   74837.000000
Driver                       6.333333  135319.333333
Economist                    5.000000  107078.666667
Electrician                  6.333333  111547.333333
Engineer                     6.000000  136454.333333
Fashion Designer             6.750000  123274.250000
Fine Artist                  6.000000  150451.000000
Firefighter                  3.000000  141092.333333
Florist                      4.000000   92666.000000
Geologist                    9.000000   96028.500000
Graphic Designer             9.333333  111001.666667
Hairdresser                  4.666667   67067.833333
Historian                    6.500000  148374.500000
Interior Designer            9.333333  115007.333333
Interpreter                  5.750000  150976.750000
Jeweller                     4.000000  101259.500000
Journalist                   5.000000  134435.800000
Lawyer                       6.800000  141520.200000
Lecturer                     6.500000  116472.500000
Manager                      7.800000  115411.800000
Mathematician                3.500000  127876.500000
Mechanic                     7.750000   89230.250000
Medic                        8.333333  119887.000000
Meteorologist                4.800000  119922.200000
Pharmacist                   7.000000  117530.333333
Photographer                 0.500000  113101.000000
Physicist                    3.000000  126988.000000
Police Officer               7.250000  100257.250000
Producer                     2.500000   92602.250000
Programmer                   9.500000   90850.500000
Salesman                     4.500000   88292.500000
Scientist                    6.714286  114704.000000
Singer                       6.714286  167146.714286
Social Worker                5.166667  113665.833333
Teacher                      5.000000  153605.500000
Veteranarian                 5.000000   64881.000000
Veterinarian                 5.000000  125092.333333

You can also group by multiple columns. We can group by occupations and then gender to examine the difference in experience and salary between genders in the same occupation.

In [30]:
df_people.groupby(['Occupation','Gender'])[['Experience (Years)', 'Salary']].mean()

                          Experience (Years)         Salary
Occupation        Gender
Accountant        Male              6.500000  132065.750000
Actor             Female            2.500000  135442.000000
                  Male             13.000000   41535.000000
Aeroplane Pilot   Male              7.000000  125381.000000
Agronamist        Male             11.000000  149123.000000
Agronomist        Female            9.000000  158383.000000
Archeologist      Male              6.000000  122474.500000
Architect         Female            8.500000  102085.500000
                  Male             11.000000  122540.000000
Astronomer        Female            5.333333  116477.666667
                  Male              2.000000  178217.000000
Auditor           Female            7.000000  145831.000000
                  Male              1.000000   71435.333333
Baker             Female            3.000000  110557.000000
                  Male              5.000000   90455.000000
Biochemist        Female            8.000000   41573.000000
                  Male              5.000000   70199.500000
Botanist          Female           11.000000   36479.000000
                  Male             10.000000   86341.500000
Bottanist         Male              1.000000   54275.500000
Carpenter         Female            3.000000  141442.000000
                  Male              6.000000  190320.000000
Chef              Female            1.000000   68102.000000
                  Male              5.500000   95221.500000
Chemist           Female           10.000000  104926.000000
                  Male             11.000000  136166.000000
Composer          Female            8.000000  131320.500000
                  Male             10.000000   60692.000000
Cook              Female            7.800000   97125.200000
                  Male             11.000000  193102.000000
Dancer            Female            0.000000   55028.000000
                  Male              5.000000   84741.500000
Driver            Male              6.333333  135319.333333
Economist         Female            6.000000   90360.000000
                  Male              3.000000  140516.000000
Electrician       Female           10.000000  105015.333333
                  Male              2.666667  118079.333333
Engineer          Female            6.750000  150362.000000
                  Male              4.500000  108639.000000
Fashion Designer  Male              6.750000  123274.250000
Fine Artist       Female            6.000000  129198.000000
                  Male              6.000000  161077.500000
Firefighter       Female            2.000000  168508.000000
                  Male              3.500000  127384.500000
Florist           Female            4.000000   92666.000000
Geologist         Female            8.000000   88624.000000
                  Male             10.000000  103433.000000
Graphic Designer  Female            8.000000  131100.500000
                  Male             12.000000   70804.000000
Hairdresser       Female            5.000000   43474.500000
                  Male              4.500000   78864.500000
Historian         Female            6.500000  148374.500000
Interior Designer Female            8.500000  100120.000000
                  Male             11.000000  144782.000000
Interpreter       Female            9.000000  140064.000000
                  Male              4.666667  154614.333333
Jeweller          Female            4.000000  101259.500000
Journalist        Female            3.333333  138955.333333
                  Male              7.500000  127656.500000
Lawer             Female            6.500000  143781.500000
                  Male              7.000000  140012.666667
Lecturer          Female            7.000000   65368.000000
                  Male              6.333333  133507.333333
Manager           Female            9.000000  127916.333333
                  Male              6.000000   96655.000000
Mathematician     Female            4.000000  160787.000000
                  Male              3.333333  116906.333333
Mechanic          Female            7.750000   89230.250000
Medic             Female            4.000000  140228.000000
                  Male             10.500000  109716.500000
Meteorologist     Female            7.000000   81342.666667
                  Male              1.500000  177791.500000
Pharmacist        Female            7.000000  102378.000000
                  Male              7.000000  147835.000000
Photographer      Female            1.000000  177842.000000
                  Male              0.000000   48360.000000
Physicist         Male              3.000000  126988.000000
Police Officer    Female            7.000000   97667.333333
                  Male              8.000000  108027.000000
Producer          Female            0.500000   73925.000000
                  Male              4.500000  111279.500000
Programmer        Male              9.500000   90850.500000
Salesman          Female            5.666667   78071.000000
                  Male              3.333333   98514.000000
Scientist         Female            6.666667  134922.333333
                  Male              6.750000   99540.250000
Singer            Female            6.200000  164170.000000
                  Male              8.000000  174588.500000
Social Worker     Female            5.000000   49669.000000
                  Male              5.200000  126465.200000
Teacher           Female            6.000000  152489.000000
                  Male              4.000000  154722.000000
Veteranarian      Male              5.000000   64881.000000
Veterinarian      Female            5.000000  145033.000000
                  Male              5.000000  115122.000000

In [7]:
occupation_grp.get_group('Engineer')

,First Name,Last Name,Gender,Age,Email,Phone,Education,Occupation,Experience (Years),Salary,Marital Status,Number of Children
4,rubie,sullivan,Female,23,r.sullivan@randatmail.com,543-4162-06,Bachelor,Engineer,8,78613,Married,4
41,alisa,cameron,Female,30,a.cameron@randatmail.com,178-7304-99,Lower secondary,Engineer,7,193299,Married,3
96,myra,barrett,Female,19,m.barrett@randatmail.com,327-1291-87,Master,Engineer,7,130894,Single,5
102,robert,edwards,Male,21,r.edwards@randatmail.com,913-0408-26,Upper secondary,Engineer,8,173872,Married,2
189,james,west,Male,19,j.west@randatmail.com,498-5620-38,Primary,Engineer,1,43406,Married,5
195,lana,ellis,Female,20,l.ellis@randatmail.com,986-4830-56,Doctoral,Engineer,5,198642,Single,2

In [58]:
salaries_df = occupation_grp['Salary'].agg(['median','mean'])
salaries_df

                     median           mean
Occupation
Accountant         149041.5  132065.750000
Actor              110315.0  104139.666667
Aeroplane Pilot    125381.0  125381.000000
Agronomist         153753.0  153753.000000
Archeologist       122474.5  122474.500000
Architect          122540.0  106176.400000
Astronomer         166753.0  141173.400000
Auditor             86784.0  101193.600000
Baker               90455.0  100506.000000
Biochemist          45265.0   60657.333333
Botanist            78710.0   69720.666667
Bottanist           54275.5   54275.500000
Carpenter          184801.0  174027.333333
Chef                85430.0   86181.666667
Chemist            104926.0  125752.666667
Composer           126503.0  117194.800000
Cook               107811.0  113121.333333
Dancer              55028.0   74837.000000
Driver             108026.0  135319.333333
Economist           96135.0  107078.666667
Electrician        130457.0  111547.333333
Engineer           152383.0  136454.333333
Fashion Designer   124607.5  123274.250000
Fine Artist        137278.0  150451.000000
Firefighter        168508.0  141092.333333
Florist            107903.0   92666.000000
Geologist           93825.0   96028.500000
Graphic Designer    81314.0  111001.666667
Hairdresser         67064.0   67067.833333
Historian          148374.5  148374.500000
Interior Designer  142614.0  115007.333333
Interpreter        164998.5  150976.750000
Jeweller           101259.5  101259.500000
Journalist         129990.0  134435.800000
Lawyer             140405.0  141520.200000
Lecturer           115742.0  116472.500000
Manager             99047.0  115411.800000
Mathematician      141401.5  127876.500000
Mechanic            83865.0   89230.250000
Medic              137587.0  119887.000000
Meteorologist      120815.0  119922.200000
Pharmacist         106810.0  117530.333333
Photographer       113101.0  113101.000000
Physicist          126988.0  126988.000000
Police Officer      94287.5  100257.250000
Producer            73925.0   92602.250000
Programmer          90850.5   90850.500000
Salesman            64523.0   88292.500000
Scientist          106119.0  114704.000000
Singer             168001.0  167146.714286
Social Worker      122430.5  113665.833333
Teacher            153605.5  153605.500000
Veteranarian        64881.0   64881.000000
Veterinarian       145033.0  125092.333333

# Handling Missing Values
Missing values are a common problem when performing data analysis. This section discusses ways to handle missing values.

In [59]:
import random
import numpy as np

import pandas as pd
df_people = pd.read_csv('files/people_data.csv')

First, to make it easier, we'll create a small subset of the people DataFrame. Note the use of ```copy()```. Using ```copy()``` creates a *deep copy* of the DataFrame. This avoids making changes to a slice or shallow copy of the DataFrame, which would yield unpredictable results and an exception

In [60]:
small_df = df_people.iloc[:10,:].copy()
small_df.head()
small_df.shape

(10, 12)

Next, we'll randomly add missing values using the ```np.NaN``` object and create one row and column of NaN values.

In [61]:
# Introduce missing (NaN) values into the small DataFame

num_missing = 5

for x in range(num_missing):
    random_row = random.randint(0,9)
    random_col = random.randint(0,9)
    small_df.iloc[random_row, random_col] = np.NaN

# Add a column of NaN values
small_df['SS#'] = np.NaN

# Add a row of NaN values
small_df.loc[len(small_df.index)] = np.NaN

The syntax of ```dropna``` is as follow:

```Python
DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
```

- **axis**: drop rows (```axis=0```) or columns (```axis=1```) which contain missing values
- **how**: drop (row|column) if it contains ```any``` missing value; only drop (row|column) if ```all``` values are missing

### Sum the count of missing values by column

In [ ]:
small_df.isna().sum()

# Casting Data Types
After creating a pandas DataFrame, you may have columns that have not been defined using the correct data type. For example, after using the ```read_csv()``` function to create the people_df, salary is defined as an integer instead of a float.

In [ ]:
df_people.dtypes

In [ ]:
df_people['Salary'] = df_people['Salary'].astype(float)

# Working with Time Series Data

# Interacting with Excel, JSON, Parquet files, SQL

## Using iloc

# Using Polars with Pandas

##

# Initialize everything

This section is provided to quickly re-load the series and dataframe objects used in this notebook

In [15]:
import pandas as pd
import numpy as np

grades = [88, 67, 100, 92, None, 95, 82, 100, 100, 95]
grade_series = pd.Series(grades)

grades = [88, 67, 100, 92, None, 95, 82, 100, 100, 95]
students = ['dmac', 'edev', 'joeb', 'tdog', 'txroy', 'sthicks', 'jfrerk', 'spickard', 'choenes', 'jsisson']
student_grades_series = pd.Series(grades, students)

df_people = pd.read_csv('files/people_data.csv')
small_df = df_people.iloc[:10,:].copy()

df_nfl = pd.read_csv('files/NFLPlaybyPlay2015.csv', low_memory = False)

pd.set_option('display.max_rows', 100)
pd.set_option('display.max_columns', 50)